BE/load-test.yml

config:
  target: 'http://localhost:3000' 
  phases:
    - duration: 10 
      arrivalRate: 1 
# password: "password123"
scenarios:
  - flow:
      - post:
          url: '/api/v1/user/register' 
          json:
            email: "user_{{ $randomString(8) }}@example.com" 
            password: "password123"
            name: "Test User"
      - post:
          url: '/api/v1/user/register' 
          json:
            email: "user_{{ $randomString(8) }}@example.com"
            password: "password123"